def date_korean_encoder(year, month, day):
    year_label = ['한', '두', '세', '네', '다섯', '여섯', '일곱', '여덟', '아홉', '열', '열한', '열두', '열세', '열네', '열다섯', '열여섯', '열일곱', '열여덟', '열아홉', '스무', '스물한', '스물두', '스물세', '스물네', '스물다섯', '스물여섯', '스물일곱', '스물여덟', '스물아홉', '서른', '서른한', '서른두', '서른세', '서른네', '서른다섯', '서른여섯', '서른일곱', '서른여덟', '서른아홉', '마흔', '마흔한', '마흔두', '마흔세', '마흔네', '마흔다섯', '마흔여섯', '마흔일곱', '마흔여덟', '마흔아홉', '쉰', '쉰한', '쉰두', '쉰세', '쉰네', '쉰다섯', '쉰여섯', '쉰일곱', '쉰여덟', '쉰아홉', '예순', '예순한', '예순두', '예순세', '예순네', '예순다섯', '예순여섯', '예순일곱', '예순여덟', '예순아홉', '일흔', '일흔한', '일흔두', '일흔세', '일흔네', '일흔다섯', '일흔여섯', '일흔일곱', '일흔여덟', '일흔아홉', '여든']
    month_label = ['정월', '이월', '삼월', '사월', '오월', '유월', '칠월', '팔월', '구월', '시월', '동짓달', '섣달']
    day_label = ['초하루', '초이틀', '초사흘', '초나흘', '초닷새', '초엿새', '초이레', '초여드레', '초아흐레', '초열흘', '열하루', '열이틀', '열사흘', '열나흘', '보름', '열엿새', '열이레', '열여드레', '열아흐레', '스무날', '스무하루', '스무이틀', '스무사흘', '스무나흘', '스무닷새', '스무엿새', '스무이레', '스무여드레', '스무아흐레', '서른날', '그믐']


    year_encoded = '두즈믄'+year_label[year%100-1]+'년'
    month_encoded = month_label[month-1]
    if month in [1,3,5,7,8,10,12]:
        day_encoded = day_label[day-1]
    elif month == 2:
        if 2024%year == 0:
            if day == 29:
                day_encoded = '그믐'
            else:
                day_encoded = day_label[day-1]
        else:
            if day == 28:
                day_encoded = '그믐'
            else:
                day_encoded = day_label[day-1]
    else:
        if day == 30:
            day_encoded = '그믐'
        else:
            day_encoded = day_label[day-1]
        

    return year_encoded + ' ' + month_encoded + ' ' + day_encoded 